{
  "projects": [
    {
      "name": "Flockx.io",
      "subheader": "AI Agent Workflow Platform",
      "url": "https://agents.flockx.io",
      "description": "Senior backend engineer and full-stack developer for Flockx.io's AI agent workflow platform built with Next.js. Architected API routes, authentication systems, and data transformation pipelines while managing cloud infrastructure including AWS S3, Cloudinary, and Redis. Implemented performance optimizations, database migrations, and site reliability engineering. Enhanced platform capabilities with LangGraph workflows, ElasticSearch integration, and third-party services like Intercom and Slack for comprehensive user engagement.",
      "technologies": [
        "LangGraph",
        "LangChain",
        "Next.js",
        "API Development",
        "Authentication",
        "AWS S3",
        "Cloudinary",
        "Redis",
        "ElasticSearch",
        "Data Migration",
        "Performance Optimization",
        "SRE"
      ]
    },
    {
      "name": "ABowlofRed.com",
      "subheader": "Non-Profit Charity",
      "url": "https://abowlofred.com",
      "description": "Orchestrated the development of ABowlofRed.com, originally a Gatsby-based front-end platform that underwent a successful migration to Astro for improved performance and developer experience. Maintained focus on high-performance and accessible design throughout the transition. Utilized Strapi CMS on AWS EC2 with Node.js for content management, ensuring optimal image rendering and SEO-friendly metadata. Successfully integrated Stripe for secure ticket transactions, contributing to a significant fundraising success of around $19k.",
      "technologies": [
        "Astro",
        "Strapi CMS",
        "AWS EC2",
        "Node.js",
        "Stripe",
        "SEO"
      ]
    },

    {
      "name": "Propane.com",
      "subheader": "Enterprise Website",
      "url": "https://propane.com",
      "description": "Spearheaded the development of Propane.com, an enterprise-level WordPress site featuring advanced customizations and integrations. Implemented a robust CI pipeline, 2FA authentication via OAuth Okta, and developed stateful web applications. Enhanced user engagement by integrating Algolia for advanced search capabilities and HubSpot for CRM. Additionally, optimized React-based components for improved site performance and user experience.",
      "technologies": [
        "WordPress",
        "React",
        "OAuth",
        "CI/CD",
        "Algolia",
        "HubSpot"
      ]
    },

    {
      "name": "Tolbert's Restaurant",
      "subheader": "Modern Restaurant Website",
      "url": "https://tolbertsrestaurant.com",
      "description": "Architected a high-performance restaurant website using Astro with a headless WordPress CMS backend. Integrated third-party menu systems and food ordering platforms through custom API routes, leveraging cloud infrastructure for optimal performance and budget efficiency. Features include dynamic calendar integration, contact forms, and seamless third-party service connections - all while maintaining exceptional accessibility and performance standards.",
      "technologies": [
        "Astro",
        "Headless WordPress",
        "Custom API Routes",
        "Third-party Integrations",
        "Cloud Infrastructure",
        "Food Ordering Systems",
        "Dynamic Calendar",
        "Performance Optimization"
      ]
    },
    {
      "name": "Junkerri.com",
      "subheader": "E-commerce Platform",
      "url": "https://junkerri.com",
      "description": "Engineered Junkerri.com, a sleek and efficient e-commerce platform using Next.js. Implemented Stripe for a streamlined payment process, and integrated SparkPost for effective customer communication. This project highlights my ability to create user-centric shopping experiences with robust back-end functionalities.",
      "technologies": ["Next.js", "Stripe", "SparkPost", "E-commerce"]
    },
    {
      "name": "AI Bible Quote Generator",
      "subheader": "Early AI Exploration",
      "url": "https://theosapp.com",
      "description": "An early exploration into AI-powered applications that, while archaic by today's rapidly evolving AI standards, was an enjoyable project during the emergence of accessible AI technology. Built with Supabase, Edge Functions, Deno, and OpenAI's early frameworks to generate personalized Bible quotes using vector similarity search. A nostalgic reminder of the exciting early days of consumer AI applications.",
      "technologies": [
        "Supabase",
        "Edge Functions",
        "Deno",
        "OpenAI",
        "Vector Search",
        "Early AI"
      ]
    },
    {
      "name": "Electron Chat App",
      "subheader": "Cross-Platform Chat Application",
      "url": "https://github.com/riefer02/electron-chat-app",
      "description": "Conceptualized and developed a cutting-edge chat application using React and Electron, demonstrating expertise in cross-platform software development. This app features real-time messaging capabilities, a user-friendly interface, and high-performance chat functionalities.",
      "technologies": ["React", "Electron", "Real-time Messaging"]
    },
    {
      "name": "Steel Calculator",
      "subheader": "Microservice Web Application",
      "url": "https://steelcalculator.xyz",
      "description": "Developed a highly specialized steel calculator application, tailored for efficiency improvements in steel-related calculations. Built using Vite, JavaScript, CSS, and HTML, this tool has proven highly effective for clients in the steel industry.",
      "technologies": ["Vite", "JavaScript", "CSS", "HTML", "Microservices"]
    }
  ]
}
